app/controllers/pages_controller.rb

   def profile
     # Grab username from the URL, as :id
   if (User.find_by_username(params[:id]))
     @username = params[:id]
   else
     # Redirect to 404 (Currently root)
      redirect_to root_path, :notice=> "The User was not found in our database"
   end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "admin"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4)  ORDER BY "posts"."created_at" DESC